/*
 Задача
 
 Используя мини-приложение, созданное в рамках задачи 6 к лекции "Менеджеры зависимостей и многопоточность". Приведите проект к архитектуре на выбор.
 
 Описание
 
     Выберите одну из общеизвестных архитектур, кроме MVC (MVP. MVVM, Viper) и измените код так чтобы каждый элемент модуля экрана выполнял только свою задачу.
     
     Разделите функционал приложения на слои согласно Service-Oriented Architecture
     
     Используйте инъекцию через конструктор где это возможно.
 
 Обязательные требования
 
     Для каждого слоя SOA должна быть отдельная папка
     Все требования изначальной задачи должны выполняться
     Приложение не должно падать.

 */
